"""Преобразования над изображением: отражение, 
наложение рамки, изменение последовательности каналов"""

import numpy as np

def reflect(img: np.ndarray, vertical: bool = True) -> np.ndarray:
    """Отразить изображение по вертикали или по горизонтали.
    
    :param img: изображение в виде массива
    :param vertical: способ отражения, по умолчанию отражает по вертикали
    :return: отражённое изображение в виде массива
    """
    if vertical:
        return img[::-1, :]
    return img[:, ::-1]
